import React, { useState } from "react"

class Content extends React.Component {
    constructor(props) {
        super(props);
        this.state = {isToggleOn: false};

        this.handleClick = this.handleClick.bind(this);

        this.state2 = {isToggleOn2: false};

        this.handleClick2 = this.handleClick2.bind(this);
    }

    handleClick() {
        this.setState(prevState => ({
        isToggleOn: !prevState.isToggleOn
        }));
    }
    handleClick2() {
        this.setState(prevState2 => ({
        isToggleOn2: !prevState2.isToggleOn2
        }));
    }
    render () { return(
        <div>
            <p>Дата народження 21.03.2001. Місце народження: Волинська область, смт Любешів</p>
            <p>"Нововолинський ліцей-інтернат", м. Нововолинськ</p>
            <p id="button_1" className={this.state.isToggleOn ? 'active' : ''} onClick={this.handleClick}>"Київський політехнічний інститут імені Ігоря Сікорського", м. Київ</p>
            
            
            <p id="button_2" className={this.state.isToggleOn2 ? 'active' : ''} onClick={this.handleClick2}>Хобі:</p>
            <ul>
                <li>Спорт</li>
                <li>Книги</li>
                <li>Компю'терні ігри</li>
            </ul>

            <p>Улюблені книги:</p>
            <ol>
                <li>"Гаррі Поттер", Джоан Роулінг</li>
                <li>"Під куполом", Стівен Кінг</li>
                <li>"Країна розваг", Стівен Кінг</li>
            </ol>
            
            <p>Варша́ва (пол. Warszawa) — столиця Польщі з 1596 року, порт на річці Вісла, адміністративний центр Мазовецького воєводства. Місто є місцем розташування центральних органів влади Республіки Польща, іноземних місій, штаб-квартир значної кількості підприємств та громадських об'єднань, що працюють в Польщі.</p>
            <p>Варшава з населенням 1 790 658 жителів є найбільшим містом Польщі й утворює другу найбільшу агломерацію в країні (після Катовицької).</p>
            <p>Розвинені машинобудування (автобудування, електротехнічне та ін.), металообробка і металургія, хімічна, парфумерна, поліграфічна, легка промисловість. Університет (1818). Національний музей (з музеєм До. Дуніковського), археологічний музей. «Театр Велькі», «Театр Польскі», «Театр народови» та ін. У місті щороку проходить міжнародний музичний фестиваль «Варшавська осінь» (з 1956).</p>
            <p>Перші поселення на території сучасної Варшави відносять до X століття. На початку XV—XVI століть столиця Мазовецького князівства, в XVI — початку XIX століть — всієї Польщі, в 1807—13 роках — Варшавського князівства, з 1815 р. — Королівства Польського (у складі Російської імперії). Після сильних руйнацій під час 2-ї світової війни відновлені: Старе місто, королівський замок XVI—XVII століть, багато костелів, палаци та парки; ансамбль Маршалковської вулиці (1960-ті рр.). Історичний центр Варшави належить до списку Світової спадщини ЮНЕСКО.</p>
        </div>
    )
    }
}

export default Content;